Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.step_functions_dashboard will be updated in-place
~ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (2 unchanged elements hidden)
                                [
                                    ".",
                                    "ExecutionsFailed",
                                    ".",
                                    ".",
                                ],
                              - [
                                  - "AWS/States",
                                  - "ExecutionsStarted",
                                  - "StateMachineArn",
                                  - "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow",
                                ],
                              - [
                                  - ".",
                                  - "ExecutionsSucceeded",
                                  - ".",
                                  - ".",
                                ],
                              - [
                                  - ".",
                                  - "ExecutionsFailed",
                                  - ".",
                                  - ".",
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ alarms = [
                                "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-automated-workflow-failures",
                              - "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-manual-workflow-failures",
                            ]
                            # (1 unchanged attribute hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                ]
            }
        )
        id             = "StepFunctionsDashboard"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.manual_step_function_log_group will be destroyed
  # (because aws_cloudwatch_log_group.manual_step_function_log_group is not in configuration)
- resource "aws_cloudwatch_log_group" "manual_step_function_log_group" {
      - arn               = "arn:aws:logs:us-east-2:390402544450:log-group:/aws/vendedlogs/states/manual_workflow" -> null
      - id                = "/aws/vendedlogs/states/manual_workflow" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/vendedlogs/states/manual_workflow" -> null
      - retention_in_days = 3 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.manual_workflow_failures will be destroyed
  # (because aws_cloudwatch_metric_alarm.manual_workflow_failures is not in configuration)
- resource "aws_cloudwatch_metric_alarm" "manual_workflow_failures" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ] -> null
      - alarm_description                     = "Alert if the manual Step Function fails within a 5-minute window." -> null
      - alarm_name                            = "wrestleutopia-manual-workflow-failures" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-manual-workflow-failures" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "StateMachineArn" = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "wrestleutopia-manual-workflow-failures" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "ExecutionsFailed" -> null
      - namespace                             = "AWS/States" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "missing" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.cross_account_sfn_role will be destroyed
  # (because aws_iam_role.cross_account_sfn_role is not in configuration)
- resource "aws_iam_role" "cross_account_sfn_role" {
      - arn                   = "arn:aws:iam::390402544450:role/CrossAccountStartExecutionRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::825765422855:root"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-03-19T16:06:31Z" -> null
      - force_detach_policies = false -> null
      - id                    = "CrossAccountStartExecutionRole" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 43200 -> null
      - name                  = "CrossAccountStartExecutionRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
      - unique_id             = "AROAVVZOOCNBI5JKMGIUG" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "AllowCrossAccountStartExecution" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "states:StartExecution"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.crossaccount_s3_read_role will be created
+ resource "aws_iam_role" "crossaccount_s3_read_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::825765422855:root"
                        }
                      + Sid       = "AllowSharedServicesAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CrossAccountS3ReadRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.allow_sfn_execution will be destroyed
  # (because aws_iam_role_policy.allow_sfn_execution is not in configuration)
- resource "aws_iam_role_policy" "allow_sfn_execution" {
      - id          = "CrossAccountStartExecutionRole:AllowCrossAccountStartExecution" -> null
      - name        = "AllowCrossAccountStartExecution" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "CrossAccountStartExecutionRole" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.crossaccount_s3_read_policy will be created
+ resource "aws_iam_role_policy" "crossaccount_s3_read_policy" {
      + id          = (known after apply)
      + name        = "WrestleUtopiaReadLogo"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-390402544450-artifacts-bucket/Logo.png"
                      + Sid      = "AllowGetLogo"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.lambda_ssm_automation will be destroyed
  # (because aws_iam_role_policy.lambda_ssm_automation is not in configuration)
- resource "aws_iam_role_policy" "lambda_ssm_automation" {
      - id          = "wrestleutopia_lambda_role:LambdaSSMAutomationPolicy" -> null
      - name        = "LambdaSSMAutomationPolicy" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:StartAutomationExecution"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "wrestleutopia_lambda_role" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.lambda_stepfunctions_policy will be destroyed
  # (because aws_iam_role_policy.lambda_stepfunctions_policy is not in configuration)
- resource "aws_iam_role_policy" "lambda_stepfunctions_policy" {
      - id          = "wrestleutopia_lambda_role:wrestleutopia_lambda_stepfunctions_policy" -> null
      - name        = "wrestleutopia_lambda_stepfunctions_policy" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "states:PutResourcePolicy",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "wrestleutopia_lambda_role" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_sfn_state_machine.manual_workflow will be destroyed
  # (because aws_sfn_state_machine.manual_workflow is not in configuration)
- resource "aws_sfn_state_machine" "manual_workflow" {
      - arn                       = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow" -> null
      - creation_date             = "2025-03-19T03:31:36Z" -> null
      - definition                = jsonencode(
            {
              - Comment = "State machine for the manual post workflow"
              - StartAt = "RenderVideo"
              - States  = {
                  - NotifyUser  = {
                      - End        = true
                      - InputPath  = "$.videoResult"
                      - Resource   = "arn:aws:lambda:us-east-2:390402544450:function:notify_post"
                      - ResultPath = "$.notificationResult"
                      - Type       = "Task"
                    }
                  - RenderVideo = {
                      - Next       = "NotifyUser"
                      - Resource   = "arn:aws:lambda:us-east-2:390402544450:function:render_video"
                      - ResultPath = "$.videoResult"
                      - Type       = "Task"
                    }
                }
            }
        ) -> null
      - id                        = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow" -> null
      - name                      = "manual_wrestleutopia_workflow" -> null
      - publish                   = false -> null
      - revision_id               = "575a6fde-32ad-4ebf-b534-474c844dcbcd" -> null
      - role_arn                  = "arn:aws:iam::390402544450:role/wrestleutopia_step_functions_role" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
      - type                      = "EXPRESS" -> null
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - kms_data_key_reuse_period_seconds = 0 -> null
          - type                              = "AWS_OWNED_KEY" -> null
            # (1 unchanged attribute hidden)
        }

      - logging_configuration {
          - include_execution_data = true -> null
          - level                  = "ALL" -> null
          - log_destination        = "arn:aws:logs:us-east-2:390402544450:log-group:/aws/vendedlogs/states/manual_workflow:*" -> null
        }

      - tracing_configuration {
          - enabled = false -> null
        }
    }

Plan: 2 to add, 1 to change, 7 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 2 to add, 1 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```